shangdawei/arm-utilities/trunk/armduino/stm32f1-devs.h
#ifndef _ARMDUINO_H
#define _ARMDUINO_H
/* armduino.h: Arduino-like programming for the STM ARM chips. */
/*
  $Revision: 1.0 $ $Date: 2011/1/22 00:00:21 $
 Hardware definition settings.
 This file provides symbolic names and macros to access the STM 32F10x
 series device registers.

 The typical header file approach of doing this is a hierarchy of macros,
 which must understood as a whole and traced through to get the final
 expansion.

 My viewpoint is that understanding the address decoding logic is of no
 value when you are programming the devices.  You want
 immediately-understood definitions that can be used as a index.  For
 other information you can have the datasheet in front of you.

 For the same reason there is no reason to re-document the details of
 a register or configuration bit.  The name only needs to evoke a memory
 of the function, not necessarily allow a reimplementation of the chip
 just from reading the source.

 In a similar vein, not every register bit needs a symbolic definition.
 Many are set once, with detailed semantics that requires a datasheet
 reference to change.  It's often difficult to hint at their semantics
 in a name of only a few characters. And for chips like the STM32, most
 configuration fields are left at their default settings

*/

#include <ARM-core.h>

#ifndef __ASSEMBLER__
/* These only work in C programs.  */
#if 0
#include <inttypes.h>

typedef unsigned int uint32_t;
typedef signed int int32_t;
typedef unsigned short uint16_t;
typedef signed short int16_t;
typedef unsigned char uint8_t;
typedef signed char int8_t;
#endif

#define _MMIO_BYTE(mem_addr) (*(volatile uint8_t *)(mem_addr))
#define _MMIO_WORD(mem_addr) (*(volatile uint16_t *)(mem_addr))
#define _MMIO_DWORD(mem_addr) (*(volatile uint32_t *)(mem_addr))
#endif

#if !defined(BITBAND_SRAM)
#define BITBAND_SRAM(byte_offset, bit) \
	((BITBAND_SRAM_BASE + (byte_offset - BITBAND_SRAM_REF)*32 + (bit*4)))
#endif

/* The AVR has a bunch of ugly types and macros to handle Harvard+flash */
#define PROGMEM const
#define PGM_P const void *
#define PSTR(str) str
#define pgm_read_byte(addr) (*(const char *)(addr))
extern int serprintf(const char *format, ...) __attribute__ ((format(printf, 1, 2)));;
typedef uint8_t prog_uint8_t;
typedef uint16_t prog_uint16_t;
typedef uint32_t prog_uint32_t;
typedef int8_t prog_int8_t;
typedef int16_t prog_int16_t;
typedef int32_t prog_int32_t;


#define TIM1		0x40012C00 	/* Timer1, not in order */
#define TIM2		0x40000000 		/* Timers 2-7 */
#define TIM3		0x40000400
#define TIM4		0x40000800
#define TIM5		0x40000C00 		/* Not on low-density parts */
#define TIM6		0x40001000
#define TIM7		0x40001400
#define TIM12		0x40001800 		/* TIM12-14 not on low-dens */
#define TIM13		0x40001C00
#define TIM14		0x40002000
#define TIM15		0x40014000 	/* Out of address order */
#define TIM16		0x40014400
#define TIM17		0x40014800

#define RTC		0x40002800
#define WWDG		0x40002800 	/* Window Watchdog timer */
#define IWDG		0x40002800 	/* Independent watchdog */
#define SPI1		0x40013000 	/* SPI 1 out of order. */
#define SPI2		0x40003800
#define SPI3		0x40003C00 	/* Hi-dens only */
#if 0
#endif
#define USART1_BASE		0x40013800 	/* Address out of order */
#define USART2_BASE		0x40004400
#define USART3_BASE		0x40004800
#define UART4_BASE		0x40004C00 	/* UART4-5 Hi-dens only */
#define UART5_BASE		0x40005000
#define I2C1_BASE		0x40005400
#define I2C2_BASE		0x40005800

#define BKP		0x40006C00 	/* Data preserved at Power-down  */
#define PWR		0x40007000 	/* Power control  */
#define DAC		0x40007400 	/* D/A converter  */
#define CEC		0x40007800 	/* Consumer Electronics  */
#define AFIO		0x40010000 	/* Alternate function remap */
#define EXTI		0x40010400 	/* External interrupt config  */

#define ADC1		0x40012400		/* A/D Converter */
/* TIM1, SPI1 UART1 and TIM15-17 are next in address order. */
#define DMA1		0x40020000
#define DMA2		0x40020400 	/* High density only */
#define RCC		0x40021000		/* Reset and Clock Control */
#define FLASH		0x40022000		/* Flash memory interface */
#define CRC		0x40023000		/* CRC Checksum generator */


/* Port A-G, base, config high/low, output data registers */
#define GPIOA_BASE	0x40010800		/* PortA register base */
#define GPIOB_BASE	0x40010C00		/* PortB register base */
#define GPIOC_BASE	0x40011000		/* PortC register base */
#define GPIOD_BASE	0x40011400		/* PortD register base */
#define GPIOE_BASE	0x40011800		/* PortE register base */
#define GPIOF_BASE	0x40011C00		/* PortF register base */
#define GPIOG_BASE	0x40012000		/* PortG register base */



#define PORTA		_MMIO_DWORD(0x40010808) /* The input data register */
#define GPIOA_CRL	_MMIO_DWORD(0x40010800)
#define GPIOA_CRH	_MMIO_DWORD(0x40010804)
#define GPIOA_IDR	_MMIO_DWORD(0x40010808)
#define GPIOA_ODR	_MMIO_DWORD(0x4001080C)
#define GPIOA_BSRR	_MMIO_DWORD(0x40010810)
#define GPIOA_BRR	_MMIO_DWORD(0x40010814)
#define GPIOA_LCKR	_MMIO_DWORD(0x40010818)

#define PORTB		_MMIO_DWORD(0x40010C08)
#define GPIOB_CRL	_MMIO_DWORD(0x40010C00)
#define GPIOB_CRH	_MMIO_DWORD(0x40010C04)
#define GPIOB_IDR	_MMIO_DWORD(0x40010C08)
#define GPIOB_ODR	_MMIO_DWORD(0x40010C0C)
#define GPIOB_BSRR	_MMIO_DWORD(0x40010C10)
#define GPIOB_BRR	_MMIO_DWORD(0x40010C14)
#define GPIOB_LCKR	_MMIO_DWORD(0x40010C18)

#define PORTC		_MMIO_DWORD(0x40011008)
#define GPIOC_CRL	_MMIO_DWORD(0x40011000)
#define GPIOC_CRH	_MMIO_DWORD(0x40011004)
#define GPIOC_IDR	_MMIO_DWORD(0x40011008)
#define GPIOC_ODR	_MMIO_DWORD(0x4001100C)
#define GPIOC_BSRR	_MMIO_DWORD(0x40011010)
#define GPIOC_BRR	_MMIO_DWORD(0x40011014)
#define GPIOC_LCKR	_MMIO_DWORD(0x40011018)

#define PORTD		_MMIO_DWORD(0x40011408)
#define GPIOD_CRL	_MMIO_DWORD(0x40011400)
#define GPIOD_CRH	_MMIO_DWORD(0x40011404)
#define GPIOD_IDR	_MMIO_DWORD(0x40011408)
#define GPIOD_ODR	_MMIO_DWORD(0x4001140C)
#define GPIOD_BSRR	_MMIO_DWORD(0x40011410)
#define GPIOD_BRR	_MMIO_DWORD(0x40011414)
#define GPIOD_LCKR	_MMIO_DWORD(0x40011418)

#define PORTE		_MMIO_DWORD(0x40011808)
#define GPIOE_CRL	_MMIO_DWORD(0x40011800)
#define GPIOE_CRH	_MMIO_DWORD(0x40011804)
#define GPIOE_IDR	_MMIO_DWORD(0x40011808)
#define GPIOE_ODR	_MMIO_DWORD(0x4001180C)
#define GPIOE_BSRR	_MMIO_DWORD(0x40011810)
#define GPIOE_BRR	_MMIO_DWORD(0x40011814)
#define GPIOE_LCKR	_MMIO_DWORD(0x40011818)

#define PORTF		_MMIO_DWORD(0x40011C08)
#define GPIOF_CRL	_MMIO_DWORD(0x40011C00)
#define GPIOF_CRH	_MMIO_DWORD(0x40011C04)
#define GPIOF_IDR	_MMIO_DWORD(0x40011C08)
#define GPIOF_ODR	_MMIO_DWORD(0x40011C0C)
#define GPIOF_BSRR	_MMIO_DWORD(0x40011C10)
#define GPIOF_BRR	_MMIO_DWORD(0x40011C14)
#define GPIOF_LCKR	_MMIO_DWORD(0x40011C18)

