shangdawei/arm-utilities/trunk/armduino/stm32f1-devs.h
#define PORTG		_MMIO_DWORD(0x40012008)
#define GPIOG_CRL	_MMIO_DWORD(0x40012000)
#define GPIOG_CRH	_MMIO_DWORD(0x40012004)
#define GPIOG_IDR	_MMIO_DWORD(0x40012008)
#define GPIOG_ODR	_MMIO_DWORD(0x4001200C)
#define GPIOG_BSRR	_MMIO_DWORD(0x40012010)
#define GPIOG_BRR	_MMIO_DWORD(0x40012014)
#define GPIOG_LCKR	_MMIO_DWORD(0x40012018)

/* Reset and Clock Control at 0x40021000 */
#define RCC_CR		_MMIO_DWORD(0x40021000)
#define RCC_CFGR	_MMIO_DWORD(0x40021004)
#define RCC_CIR		_MMIO_DWORD(0x40021008)
#define APB2RSTR	_MMIO_DWORD(0x4002100C)
#define APB1RSTR	_MMIO_DWORD(0x40021010)
#define AHBENR		_MMIO_DWORD(0x40021014)
#define APB2ENR		_MMIO_DWORD(0x40021018)	/* Enable peripheral clocks */
#define APB1ENR		_MMIO_DWORD(0x4002101C)
#define RCC_BDCR	_MMIO_DWORD(0x40021020)
#define RCC_CSR		_MMIO_DWORD(0x40021024)
#define RCC_CFGR2	_MMIO_DWORD(0x4002102C)

/* Timer registers.  32 bit access used, 16 bit access also OK*/
/* Timer 1 base is at 0x40012C00 */
#define TIM1_CR1	_MMIO_DWORD(0x40012C00)
#define TIM1_CR2	_MMIO_DWORD(0x40012C04)
#define TIM1_SMCR	_MMIO_DWORD(0x40012C08)
#define TIM1_DIER	_MMIO_DWORD(0x40012C0C)
#define TIM1_SR		_MMIO_DWORD(0x40012C10)
#define TIM1_EGR	_MMIO_DWORD(0x40012C14)
#define TIM1_CCMR1	_MMIO_DWORD(0x40012C18) /* chn 1 & 2 */
#define TIM1_CCMR2	_MMIO_DWORD(0x40012C1C) /* chn 3 & 4 */
#define TIM1_CCER	_MMIO_DWORD(0x40012C20)
#define TIM1_CNT	_MMIO_DWORD(0x40012C24) /* Count value */
#define TIM1_PSC	_MMIO_DWORD(0x40012C28) /* Prescale divider */
#define TIM1_ARR	_MMIO_DWORD(0x40012C2C) /* Counter reset value. */
#define TIM1_RCR	_MMIO_DWORD(0x40012C30) /* Repetition counter. */
#define TIM1_CCR1	_MMIO_DWORD(0x40012C34) /* Capture/compare values. */
#define TIM1_CCR2	_MMIO_DWORD(0x40012C38)
#define TIM1_CCR3	_MMIO_DWORD(0x40012C3C)
#define TIM1_CCR4	_MMIO_DWORD(0x40012C40)
#define TIM1_BDTR	_MMIO_DWORD(0x40012C44)
#define TIM1_DCR	_MMIO_DWORD(0x40012C48) /* DMA config and address */
#define TIM1_DMAR	_MMIO_DWORD(0x40012C4C)

/* Timer 2 base is at 0x40000000 */
#define TIM2_CR1	_MMIO_DWORD(0x40000000)
#define TIM2_CR2	_MMIO_DWORD(0x40000004)
#define TIM2_SMCR	_MMIO_DWORD(0x40000008)
#define TIM2_DIER	_MMIO_DWORD(0x4000000C)
#define TIM2_SR		_MMIO_DWORD(0x40000010)
#define TIM2_EGR	_MMIO_DWORD(0x40000014)
#define TIM2_CCMR1	_MMIO_DWORD(0x40000018) /* chn 1 & 2 */
#define TIM2_CCMR2	_MMIO_DWORD(0x4000001C) /* chn 3 & 4 */
#define TIM2_CCER	_MMIO_DWORD(0x40000020)
#define TIM2_CNT	_MMIO_DWORD(0x40000024) /* Count value */
#define TIM2_PSC	_MMIO_DWORD(0x40000028) /* Prescale divider */
#define TIM2_ARR	_MMIO_DWORD(0x4000002C) /* Counter reset value. */
/* No RCR / repetition counter, it is only on TIM1. */
#define TIM2_CCR1	_MMIO_DWORD(0x40000034) /* Capture/compare values. */
#define TIM2_CCR2	_MMIO_DWORD(0x40000038)
#define TIM2_CCR3	_MMIO_DWORD(0x4000003C)
#define TIM2_CCR4	_MMIO_DWORD(0x40000040)
/* No DeadTime / BDTR register, it is only on TIM1. */
#define TIM2_DCR	_MMIO_DWORD(0x40000048) /* DMA config and address */
#define TIM2_DMAR	_MMIO_DWORD(0x4000004C)
#define TIM2_OR 	_MMIO_DWORD(0x40000050) /* Trigger options, only w/TIM2 */

/* Timer 3 registers, base 0x40000400. */
#define TIM3_CR1	_MMIO_DWORD(0x40000400)
#define TIM3_CR2	_MMIO_DWORD(0x40000404)
#define TIM3_SMCR	_MMIO_DWORD(0x40000408)
#define TIM3_DIER	_MMIO_DWORD(0x4000040C)
#define TIM3_SR		_MMIO_DWORD(0x40000410)
#define TIM3_EGR	_MMIO_DWORD(0x40000414)
#define TIM3_CCMR1	_MMIO_DWORD(0x40000418) /* chn 1 & 2 */
#define TIM3_CCMR2	_MMIO_DWORD(0x4000041C) /* chn 3 & 4 */
#define TIM3_CCER	_MMIO_DWORD(0x40000420)
#define TIM3_CNT	_MMIO_DWORD(0x40000424) /* Count value */
#define TIM3_PSC	_MMIO_DWORD(0x40000428) /* Prescale divider */
#define TIM3_ARR	_MMIO_DWORD(0x4000042C) /* Counter reset value. */
#define TIM3_CCR1	_MMIO_DWORD(0x40000434) /* Capture/compare values. */
#define TIM3_CCR2	_MMIO_DWORD(0x40000438)
#define TIM3_CCR3	_MMIO_DWORD(0x4000043C)
#define TIM3_CCR4	_MMIO_DWORD(0x40000440)
#define TIM3_DCR	_MMIO_DWORD(0x40000448) /* DMA config and address */
#define TIM3_DMAR	_MMIO_DWORD(0x4000044C)

/* Timer 4 registers, base 0x40000800. */
#define TIM4_CR1	_MMIO_DWORD(0x40000800)
#define TIM4_CR2	_MMIO_DWORD(0x40000804)
#define TIM4_SMCR	_MMIO_DWORD(0x40000808)
#define TIM4_DIER	_MMIO_DWORD(0x4000080C)
#define TIM4_SR		_MMIO_DWORD(0x40000810)
#define TIM4_EGR	_MMIO_DWORD(0x40000814)
#define TIM4_CCMR1	_MMIO_DWORD(0x40000818) /* chn 1 & 2 */
#define TIM4_CCMR2	_MMIO_DWORD(0x4000081C) /* chn 3 & 4 */
#define TIM4_CCER	_MMIO_DWORD(0x40000820)
#define TIM4_CNT	_MMIO_DWORD(0x40000824) /* Count value */
#define TIM4_PSC	_MMIO_DWORD(0x40000828) /* Prescale divider */
#define TIM4_ARR	_MMIO_DWORD(0x4000082C) /* Counter reset value. */
#define TIM4_CCR1	_MMIO_DWORD(0x40000834) /* Capture/compare values. */
#define TIM4_CCR2	_MMIO_DWORD(0x40000838)
#define TIM4_CCR3	_MMIO_DWORD(0x4000083C)
#define TIM4_CCR4	_MMIO_DWORD(0x40000840)
#define TIM4_DCR	_MMIO_DWORD(0x40000848) /* DMA config and address */
#define TIM4_DMAR	_MMIO_DWORD(0x4000084C)

/* Window Watchdog timer */
#define WWDG_CR		_MMIO_DWORD(0x40002800)
#define  WDGA	0x80
#define WWDG_CFR	_MMIO_DWORD(0x40002804)
#define WWDG_SR		_MMIO_DWORD(0x40002808)
#define  EWIF	0x01

#define SPI1		0x40013000 	/* SPI 1 is not in address order. */
#define SPI1_CR1	_MMIO_WORD(0x40013000)
#define  SPI_LSBFIRST	0x0080
#define  SPI_SPE	0x0040
#define  SPI_BR0	3			/* Shift value */
#define  SPI_BRdiv2 0x0000
#define  SPI_BRdiv4 0x0008
#define  SPI_BRdiv8 0x0010
#define  SPI_MSTR	0x0004
#define  SPI_CPOL	0x0002		/* Clock polarity and phase */
#define  SPI_CPHA	0x0001
#define SPI1_CR2	_MMIO_WORD(0x40013004)
#define  SPI_TXEIE	0x0080
#define  SPI_RXNEIE	0x0040
#define  SPI_ERRIE	0x0020
#define  SPI_SSOE	0x0004
#define  SPI_TXDMAEN	0x0002
#define  SPI_RXDMAEN	0x0001
#define SPI1_SR 	_MMIO_WORD(0x40013008)
#define  SPI_TXE	0x02
#define  SPI_RXNE	0x01
#define SPI1_DR 	_MMIO_WORD(0x4001300C)
#define SPI1_CRC 	_MMIO_WORD(0x40013010)
#define SPI1_RXCRCR	_MMIO_WORD(0x40013014)
#define SPI1_TXCRCR	_MMIO_WORD(0x40013018)

