shangdawei/arm-utilities/trunk/armduino/stm32f1-devs.h
#define USART1_SR	_MMIO_WORD(0x40013800)
#define  USART_CTS	0x200
#define  USART_LBD	0x100
#define  USART_TXE	0x80
#define  USART_TC	0x40
#define  USART_RXNE	0x20
#define  USART_IDLE	0x10
#define  USART_OVE	0x08
#define  USART_NF	0x04
#define  USART_FE	0x02
#define  USART_PE	0x01
#define USART1_DR	_MMIO_WORD(0x40013804)
#define USART1_BRR	_MMIO_WORD(0x40013808)
#define USART1_CR1	_MMIO_WORD(0x4001380C)
#define  USART_OVER8 0x8000		/* 0: 16x baud clock, 1: 8x clock */
#define  USART_UE 	 0x2000		/* USART enable */
#define  USART_M9	 0x1000		/* Set for 9 bits */
#define  USART_PCE	 0x0400		/* Set for parity on */
#define  USART_PS	 0x0200		/* Set for odd parity */
#define  USART_TXEIE 0x0080		/* TXE interrupt enable */
#define  USART_TCIE	 0x0040		/* Tx done interrupt enable */
#define  USART_RXNEIE 0x0020	/* Rx not empty interrupt enable */
#define  USART_TE	 0x0008		/* Tx enable */
#define  USART_RE	 0x0004		/* Rx enable */
#define USART1_CR2	_MMIO_WORD(0x40013810)
#define USART1_CR3	_MMIO_WORD(0x40013814)
#define USART1_GTPR	_MMIO_WORD(0x40013818)

#define USART2_SR	_MMIO_WORD(0x40004400)
#define USART2_DR	_MMIO_WORD(0x40004404)
#define USART2_BRR	_MMIO_WORD(0x40004408)
#define USART2_CR1	_MMIO_WORD(0x4000440C)
#define USART2_CR2	_MMIO_WORD(0x40004410)
#define USART2_CR3	_MMIO_WORD(0x40004414)
#define USART2_GTPR	_MMIO_WORD(0x40004418)

#define USART3_SR	_MMIO_WORD(0x40004800)
#define USART3_DR	_MMIO_WORD(0x40004804)
#define USART3_BRR	_MMIO_WORD(0x40004808)
#define USART3_CR1	_MMIO_WORD(0x4000480C)
#define USART3_CR2	_MMIO_WORD(0x40004810)
#define USART3_CR3	_MMIO_WORD(0x40004814)
#define USART3_GTPR	_MMIO_WORD(0x40004818)

/* Alternate function configuration */
#define AFIO_EVCR	_MMIO_DWORD(0x40010000)
#define AFIO_MAPR	_MMIO_DWORD(0x40010004)
#define AFIO_MAPR1	_MMIO_DWORD(0x40010004)
#define  REMAP1_JTAGRST_OFF	 0x01000000
#define  REMAP1_JTAG_OFF	 0x02000000
#define  REMAP1_JTAG_SWD_OFF 0x04000000
#define  REMAP1_TIM4	0x1000
#define  REMAP1_USART2  0x0008
#define  REMAP1_USART1  0x0004
#define  REMAP1_I2C1	0x0002
#define  REMAP1_SPI1	0x0001

#define AFIO_MAPR2	_MMIO_DWORD(0x4001001C)
#define AFIO_EXTICR1	_MMIO_DWORD(0x40010008)
#define AFIO_EXTICR2	_MMIO_DWORD(0x4001000C)
#define AFIO_EXTICR3	_MMIO_DWORD(0x40010010)
#define AFIO_EXTICR4	_MMIO_DWORD(0x40010014)

#define ADC1_BASE		0x40012400	/* A/D Converter, dword access only */
#define ADC1_SR		_MMIO_DWORD(0x40012400)
#define  ADC_STRT	 0x0010
#define  ADC_JSTRT	 0x0008
#define  ADC_JEOC	 0x0004		/* End of injected conversion signal */
#define  ADC_EOC	 0x0002		/* End of conversion signal */
#define  ADC_AWD	 0x0001
#define ADC1_CR1	_MMIO_DWORD(0x40012404)
#define ADC1_CR2	_MMIO_DWORD(0x40012408)
#define  ADC_TSVREFE  0x800000	/* Enable temp and 1.2V channels. */
#define  ADC_SWSTART  0x400000	/* Start conversion of regular channels */
#define  ADC_JSWSTART 0x200000	/* Start conversion of injected channels */
#define  ADC_EXTTRIG  0x100000	/* Trigger mode for regular channels */
#define  ADC_JEXTTRIG 0x8000	/* Trigger source for injected channels */
#define  ADC_ALIGN	  0x0800	/* Set for left alignment */
#define  ADC_RSTCAL	  0x0008
#define  ADC_CAL	  0x0004
#define  ADC_CONT	  0x0002
#define  ADC_ADON	  0x0001
#define ADC1_SMPR1	_MMIO_DWORD(0x4001240C)
#define ADC1_SMPR2	_MMIO_DWORD(0x40012410)
#define ADC1_JOFR1	_MMIO_DWORD(0x40012414) /* ADC injected sequence list */
#define ADC1_JOFR2	_MMIO_DWORD(0x40012418)
#define ADC1_JOFR3	_MMIO_DWORD(0x4001241C)
#define ADC1_JOFR4	_MMIO_DWORD(0x40012420)
#define ADC1_HTR	_MMIO_DWORD(0x40012424) /* Comparator high threshold  */
#define ADC1_LTR	_MMIO_DWORD(0x40012428) /* Comparator low threshold  */
#define ADC1_SQR1	_MMIO_DWORD(0x4001242C) /* ADC regular scan sequence list */
#define ADC1_SQR2	_MMIO_DWORD(0x40012430)
#define ADC1_SQR3	_MMIO_DWORD(0x40012434)
#define ADC1_JSQR	_MMIO_DWORD(0x40012438) /* Injected sequence list */
#define ADC1_JDR1	_MMIO_DWORD(0x4001243C) /* Injected conversion result */
#define ADC1_JDR2	_MMIO_DWORD(0x40012440) /* Injected conversion result */
#define ADC1_JDR3	_MMIO_DWORD(0x40012444) /* Injected conversion result */
#define ADC1_JDR4	_MMIO_DWORD(0x40012448) /* Injected conversion result */
#define ADC1_DR		_MMIO_DWORD(0x4001244C) /* ADC result */

#define DMA_ISR		_MMIO_DWORD(0x40020000) /* DMA1 intr status */
#define DMA_IFCR	_MMIO_DWORD(0x40020004) /* DMA1 ctrl */
#define DMA_CCR1	_MMIO_DWORD(0x40020008) /* DMA1 ch1 control/config */
#define DMA_CNDTR1	_MMIO_DWORD(0x4002000C) /*  data count */
#define DMA_CPAR1	_MMIO_DWORD(0x40020010) /*  peripheral addr */
#define DMA_CMAR1	_MMIO_DWORD(0x40020014) /*  memory addr*/
#define DMA_CCR2	_MMIO_DWORD(0x4002001C) /* DMA1 ch2 control/config */
#define DMA_CNDTR2	_MMIO_DWORD(0x40020020) /*  data count */
#define DMA_CPAR2	_MMIO_DWORD(0x40020024) /*  peripheral addr */
#define DMA_CMAR2	_MMIO_DWORD(0x40020028) /*  memory addr*/
#define DMA_CCR3	_MMIO_DWORD(0x40020030) /* DMA1 ch3 control/config */
#define DMA_CNDTR3	_MMIO_DWORD(0x40020034) /*  data count */
#define DMA_CPAR3	_MMIO_DWORD(0x40020038) /*  peripheral addr */
#define DMA_CMAR3	_MMIO_DWORD(0x4002003C) /*  memory addr*/
#define DMA_CCR4	_MMIO_DWORD(0x40020044) /* DMA1 ch4 control/config */
#define DMA_CNDTR4	_MMIO_DWORD(0x40020048) /*  data count */
#define DMA_CPAR4	_MMIO_DWORD(0x4002004C) /*  peripheral addr */
#define DMA_CMAR4	_MMIO_DWORD(0x40020050) /*  memory addr*/
#define DMA_CCR5	_MMIO_DWORD(0x40020058) /* DMA1 ch5 control/config */
#define DMA_CNDTR5	_MMIO_DWORD(0x4002005C) /*  data count */
#define DMA_CPAR5	_MMIO_DWORD(0x40020060) /*  peripheral addr */
#define DMA_CMAR5	_MMIO_DWORD(0x40020064) /*  memory addr*/
#define DMA_CCR6	_MMIO_DWORD(0x4002006C) /* DMA1 ch6 control/config */
#define DMA_CNDTR6	_MMIO_DWORD(0x40020070) /*  data count */
#define DMA_CPAR6	_MMIO_DWORD(0x40020074) /*  peripheral addr */
#define DMA_CMAR6	_MMIO_DWORD(0x40020078) /*  memory addr*/
#define DMA_CCR7	_MMIO_DWORD(0x40020080) /* DMA1 ch7 control/config */
#define DMA_CNDTR7	_MMIO_DWORD(0x40020084) /*  data count */
#define DMA_CPAR7	_MMIO_DWORD(0x40020088) /*  peripheral addr */
#define DMA_CMAR7	_MMIO_DWORD(0x4002008C) /*  memory addr*/



