shangdawei/arm-utilities/trunk/armduino/stm32f1-devs.h
#define CAN1_MCR	_MMIO_DWORD(0x40006400) /* CAN master control register. */
#define  CAN_MCR_DBF   0x10000	/* Set to turn off Rx/Tx during debug. */
#define  CAN_MCR_RESET 0x8000	/* Reset and leave in sleep mode. */
#define  CAN_MCR_TTCM 0x80
#define  CAN_MCR_ABOM 0x40		/* A good example of why symbolic names */
#define  CAN_MCR_AWUM 0x20		/* are of marginal use -- you must read */
#define  CAN_MCR_NART 0x10		/* the manual to understand anyway. */
#define  CAN_MCR_RFLM	0x08
#define  CAN_MCR_TXFP	0x04
#define  CAN_MCR_SLEEP	0x02
#define  CAN_MCR_INRQ	0x01		/* Initialization request. */
#define CAN1_MSR	_MMIO_DWORD(0x40006404) /* Status register. */
#define  CAN_MSR_SLAKI	0x10		/* Sleep interrupt+ack. */
#define  CAN_MSR_WAKI	0x08		/* Wake  interrupt+ack. */
#define  CAN_MSR_ERRI	0x04		/* Error interrupt+ack. */
#define  CAN_MSR_SLAK	0x02		/* Sleep ack. */
#define  CAN_MSR_INAK	0x01		/* Initialization ack. */
#define CAN1_TSR	_MMIO_DWORD(0x40006408) /* Tx status register. */
#define  CAN_TSR_TME2  0x10000000
#define  CAN_TSR_TME1  0x08000000
#define  CAN_TSR_TME0  0x04000000
#define  CAN_TSR_TERR0 0x0002
#define  CAN_TSR_TXOK0 0x0002
#define  CAN_TSR_RQCP0 0x0001
#define CAN1_RF0R	_MMIO_DWORD(0x4000640C) /* Rx FIFO 0 status register. */
#define  CAN_RxFIFO_Release 0x20
#define  CAN_RxFIFO_FMP 0x03
#define CAN1_RF1R	_MMIO_DWORD(0x40006410) /* Rx FIFO 1 */
#define CAN1_IER	_MMIO_DWORD(0x40006414) /* Interrupt enable. */
/* Interrupt enables */
#define  CAN_IER_Rx1Msg	0x0010
#define  CAN_IER_FMPIE1	0x0010
#define  CAN_IER_Rx0Msg	0x0002
#define  CAN_IER_FMPIE0	0x0002
#define  CAN_IER_TMEIE	0x0001
#define CAN1_ESR	_MMIO_DWORD(0x40006418) /* Error status. */
#define CAN1_BTR	_MMIO_DWORD(0x4000641C) /* Bit timing. */
#define  CAN_BTR_SILM	0x80000000			/* Silent mode */
#define  CAN_BTR_LBKM	0x40000000			/* Loopback mode */
#define CAN1_TI0R 	_MMIO_DWORD(0x40006580) /* Tx mailbox 0 ID */
#define CAN1_TI1R 	_MMIO_DWORD(0x40006590) /* Tx 1 ID */
#define CAN1_TI2R 	_MMIO_DWORD(0x400065A0) /* Tx 2 ID */
#define CAN1_RI0R 	_MMIO_DWORD(0x400065B0) /* Rx mailbox 0 ID */
#define CAN1_RI1R 	_MMIO_DWORD(0x400065C0) /* Rx 1 ID */

#define CAN_FMR 	_MMIO_DWORD(0x40006600) /* Filter master register */
/* The following are bitmaps for the 14 or 28 filter sets. */
#define CAN_FM1R 	_MMIO_DWORD(0x40006604) /* Filter mode, ID+mask or ID+ID */
#define CAN_FS1R 	_MMIO_DWORD(0x4000660C) /* Filter scale */
#define CAN_FFA1R 	_MMIO_DWORD(0x40006614) /* Filter to RxFIFO 0 or 1 */
#define CAN_FA1R 	_MMIO_DWORD(0x4000661C) /* Filter activation */
#define CAN_FILTERS  (&_MMIO_DWORD(0x40006640))

#define CAN2_MCR	_MMIO_DWORD(0x40006800) /* CAN master control register. */
#define CAN2_MSR	_MMIO_DWORD(0x40006804) /* Status register. */
#define CAN2_TSR	_MMIO_DWORD(0x40006808) /* Tx status register. */
#define CAN2_RF0R	_MMIO_DWORD(0x4000680C) /* Rx FIFO 0 status register. */
#define CAN2_RF1R	_MMIO_DWORD(0x40006810) /* Rx FIFO 1 */
#define CAN2_IER	_MMIO_DWORD(0x40006814) /* Interrupt enable. */
#define CAN2_ESR	_MMIO_DWORD(0x40006818) /* Error status. */
#define CAN2_BTR	_MMIO_DWORD(0x4000681C) /* Bit timing. */
#define CAN2_TI0R 	_MMIO_DWORD(0x40006980)
#define CAN2_TI1R 	_MMIO_DWORD(0x40006990)
#define CAN2_TI2R 	_MMIO_DWORD(0x400069A0)
#define CAN2_RI0R 	_MMIO_DWORD(0x400069B0)
#define CAN2_RI1R 	_MMIO_DWORD(0x400069C0)


/* Reset and Clock enables bits in APB1RSTR and APB1ENR: */
#define APB1ENR_TIM2EN  0x0001
#define APB1ENR_TIM3EN  0x0002
#define APB1ENR_TIM4EN  0x0004
#define APB1ENR_TIM5EN  0x0008
#define APB1ENR_TIM6EN  0x0010
#define APB1ENR_TIM7EN  0x0020
#define APB1ENR_TIM12EN 0x0040
#define APB1ENR_TIM13EN 0x0080
#define APB1ENR_TIM14EN 0x0100
#define APB1ENR_WWDGEN  0x0800	    /* Window Watchdog */
#define APB1ENR_SPI2EN  0x4000
#define APB1ENR_SPI3EN  0x8000
#define APB1ENR_USART2EN 0x00020000
#define APB1ENR_USART3EN 0x00040000
#define APB1ENR_UART4EN	 0x00080000
#define APB1ENR_UART5EN	 0x00100000
#define APB1ENR_I2C1EN	 0x00200000
#define APB1ENR_I2C2EN	 0x00400000
#define APB1ENR_USBEN	 0x00800000  /* USB */
#define APB1ENR_CAN1EN	 0x02000000  /* CAN bus */
#define APB1ENR_CAN2EN	 0x04000000
#define APB1ENR_BKPEN	 0x08000000  /* Backup interface */
#define APB1ENR_PWREN	 0x10000000  /* Power interface */
#define APB1ENR_DACEN	 0x20000000
#define APB1ENR_CECEN	 0x40000000  /* CEC interface */ 

#define I2C1_BASE		0x40005400
#define I2C1_CR1	_MMIO_WORD(0x40005400)
#define I2C1_CR2	_MMIO_WORD(0x40005404)
#define I2C1_OAR1	_MMIO_WORD(0x40005408) /* Address register */
#define I2C1_OAR2	_MMIO_WORD(0x4000540C) /* Secondary address */
#define I2C1_DR 	_MMIO_WORD(0x40005410) /* Secondary address */
#define I2C1_SR1 	_MMIO_WORD(0x40005414) /* Status register */
#define I2C1_SR2 	_MMIO_WORD(0x40005418) /* Clock control */
#define I2C1_CCR 	_MMIO_WORD(0x4000541C) /* Clock divider */
#define I2C1_TRISE 	_MMIO_WORD(0x40005420) /* Rise time */

#define I2C2_BASE		0x40005800
#define I2C2_CR1	_MMIO_WORD(0x40005800)
#define I2C2_CR2	_MMIO_WORD(0x40005804)
#define I2C2_OAR1	_MMIO_WORD(0x40005808) /* Address register */
#define I2C2_OAR2	_MMIO_WORD(0x4000580C) /* Secondary address */
#define I2C2_DR 	_MMIO_WORD(0x40005810) /* Secondary address */
#define I2C2_SR1 	_MMIO_WORD(0x40005814) /* Status register */
#define I2C2_SR2 	_MMIO_WORD(0x40005818) /* Clock control */
#define I2C2_CCR 	_MMIO_WORD(0x4000581C) /* Clock divider */
#define I2C2_TRISE 	_MMIO_WORD(0x40005820) /* Rise time */

#if defined(STM32F10X_LD_VL) || defined(STM32F10X_MD_VL)
#undef APB1ENR_CAN1EN
#endif

#if defined(STM32F10X_LD_VL) || defined(STM32F10X_LD)
#undef APB1ENR_TIM4EN
#undef APB1ENR_SPI2EN
#undef APB1ENR_USART3EN
#undef APB1ENR_I2C2EN
#endif

#if ! (defined(STM32F10X_HD) || defined(STM32F10X_MD) || defined(STM32F10X_LD))
#undef APB1ENR_USBEN
#endif

#if ! (defined (STM32F10X_HD) || defined  (STM32F10X_CL))
#undef APB1ENR_TIM5EN
#undef APB1ENR_TIM6EN
#undef APB1ENR_TIM7EN
#undef APB1ENR_SPI3EN
#undef APB1ENR_UART4EN
#undef APB1ENR_UART5EN
#undef APB1ENR_DACEN
#endif

#if defined (STM32F10X_LD_VL) || defined  (STM32F10X_MD_VL)
#undef APB1ENR_TIM6EN
#undef APB1ENR_TIM7EN
#undef APB1ENR_DACEN
#undef APB1ENR_CECEN
#endif

