shangdawei/arm-utilities/trunk/armduino/stm32f1-devs.h
#if ! defined(STM32F10X_CL)
#undef APB1ENR_CAN2EN
#endif

#if ! defined(STM32F10X_XL)
#undef APB1ENR_TIM12EN
#undef APB1ENR_TIM13EN
#undef APB1ENR_TIM14EN
#endif

#define APB2ENR_AFIOEN  0x00000001 /* Alternate Function I/O clock enable */
#define APB2ENR_IOPAEN  0x00000004 /* I/O port A clock enable */
#define APB2ENR_IOPBEN  0x00000008 /* I/O port B clock enable */
#define APB2ENR_IOPCEN  0x00000010 /* I/O port C clock enable */
#define APB2ENR_IOPDEN  0x00000020 /* I/O port D clock enable */
#define APB2ENR_ADC1EN  0x00000200 /* ADC 1 interface clock enable */

#if !defined (STM32F10X_LD_VL) && !defined (STM32F10X_MD_VL)
#define APB2ENR_ADC2EN  0x00000400 /* ADC 2 interface clock enable */
#endif

#define APB2ENR_TIM1EN  0x00000800 /* TIM1 Timer clock enable */
#define APB2ENR_SPI1EN  0x00001000 /* SPI 1 clock enable */
#define APB2ENR_USART1EN  0x00004000 /* USART1 clock enable */

#if defined (STM32F10X_LD_VL) || defined (STM32F10X_MD_VL)
#define APB2ENR_TIM15EN  0x00010000 /* TIM15 Timer clock enable */
#define APB2ENR_TIM16EN  0x00020000 /* TIM16 Timer clock enable */
#define APB2ENR_TIM17EN  0x00040000 /* TIM17 Timer clock enable */
#endif

#if !defined (STM32F10X_LD) && !defined (STM32F10X_LD_VL)
 #define APB2ENR_IOPEEN  0x00000040 /* I/O port E clock enable */
#endif

#if defined (STM32F10X_HD) || defined (STM32F10X_XL)
 #define APB2ENR_IOPFEN  0x00000080 /* I/O port F clock enable */
 #define APB2ENR_IOPGEN  0x00000100 /* I/O port G clock enable */
 #define APB2ENR_TIM8EN  0x00002000 /* TIM8 Timer clock enable */
 #define APB2ENR_ADC3EN  0x00008000 /* DMA1 clock enable */
#endif

#ifdef STM32F10X_XL
 #define APB2ENR_TIM9EN  0x00080000 /* TIM9 Timer clock enable  */
 #define APB2ENR_TIM10EN  0x00100000 /* TIM10 Timer clock enable  */
 #define APB2ENR_TIM11EN  0x00200000 /* TIM11 Timer clock enable */
#endif

#define CRC_DR	_MMIO_DWORD(0x40023000)
#define CRC_IDR _MMIO_DWORD(0x40023004) 	/* 8 bit temp reg, pointless */
#define CRC_CR	_MMIO_DWORD(0x40023008) 	/* Reset by writing 0x01 */


#define __INTR_ATTRS used,interrupt
#define __ISR_ATTRS __attribute__((__INTR_ATTRS)) 
#define IRQHandler(vector, ...) ISR(vector, __VA_ARGS__)
#define ISR(vector, ...)            \
    void vector##_IRQHandler(void) __attribute__ ((__INTR_ATTRS)) __VA_ARGS__; \
    void vector##_IRQHandler(void)

/* STM32 interrupt index.  This number is used when enabling the
 * interrupt or setting the priority.
 */
enum STM_Interrupts {
	WWDG_Intr=0, PVD_Intr=1, TAMPER_STAMP_Intr=2,
	RTC_WKUP_Intr=3, FLASH_Intr=4, RCC_Intr=5,
	EXTI0_Intr=6, EXTI1_Intr=7, EXTI2_Intr=8, EXTI3_Intr=9, EXTI4_Intr=10,
	DMA1_Channel1_Intr=11, DMA1_Channel2_Intr=12, DMA1_Channel3_Intr=13,
	DMA1_Channel4_Intr=14, DMA1_Channel5_Intr=15, DMA1_Channel6_Intr=16,
	DMA1_Channel7_Intr=17,
	ADC1_Intr=18,
	CAN1_Tx_Intr=19, CAN1_Rx0_Intr=20, CAN1_Rx1_Intr=21, CAN1_SCE_Intr=22,
	EXTI9_5_Intr=23,
	TIM1_BRK_TIM15_Intr=24, TIM1_UP_TIM16_Intr=25, TIM1_TRG_COM_TIM17_Intr=26,
	TIM1_CC_Intr=27, TIM2_Intr=28, TIM3_Intr=29, TIM4_Intr=30,
	I2C1_EV_Intr=31, I2C1_ER_Intr=32,  I2C2_EV_Intr=33, I2C2_ER_Intr=34,
	SPI1_Intr=35, SPI2_Intr=36,
	USART1_Intr=37, USART2_Intr=38, USART3_Intr=39,
	EXTI15_10_Intr=40, RTC_Alarm_Intr=41,
	CEC_Intr=42, USBWakeUp_Intr=42,		/* Alt: USB On-The-Go FS Wakeup */
	TIM12_Intr=43, TIM13_Intr=44, TIM14_Intr=45,
	/* Only on some chips. */
	TIM8_CC_Intr=46, ADC3_Intr=47, 
	FSMC_Intr=48,
	SDIO_Intr=49, USB_OTG_FS_WKUP_Intr=49, /* Overlap, dependent on chip */
	TIM5_Intr=50, SPI3_Intr=51, UART4_Intr=52, UART5_Intr=53,
	TIM6_DAC_Intr=54, TIM7_Intr=55,
	DMA2_Channel1_Intr=56, DMA2_Channel2_Intr=57, DMA2_Channel3_Intr=58,
	DMA2_Channel4_5_Intr=59, DMA2_Channel5_Intr=60,
	ETH_Intr=61, ETH_WkUp_Intr=62,
	CAN2_Tx_Intr=63, CAN2_Rx0_Intr=64, CAN2_Rx1_Intr=65, CAN2_SCE_Intr=66,
	USB_OTG_FS_Intr=67
};

#endif
/*
 * Local variables:
 *  c-indent-level: 4
 *  c-basic-offset: 4
 *  tab-width: 4
 * End:
 */
